(function() {
	
	var ADDR	= [];
	
	var GRP	= [
		// id, name, title
		[05, "welcome", "즐겨찾기"],
		[10, "uway", "유웨이어플라이"],
		[11, "subsidiary", "가족회사"],
		[12, "partner", "협력업체"],
		[13, "resigned", "퇴사자"],
		[14, "oldcolleague", "옛동료"],
		[15, "friends", "친구"],
		[16, "family", "가족"],
		[17, "dev1role", "Dev1 업무분장"],
		[99, "search", "검색"]
		//[13, "etcetera", "기타"],
	];
	
	ADDR["welcome"]		= [];
	
	ADDR["uway"] = [
		["팀"            ,"직급"   ,"이름"  ,"업무"             ,"회사전화" ,"휴대전화"      ,"eMail"             ,"기타"],
		["기술본부"      ,"상무"   ,"이일재",""                 ,"2102-5683","010-3407-3823" ,""                  ,"71"],
		["개발1팀"       ,"팀장"   ,"이상수","원서접수 총괄"    ,"2102-5561","010-6855-9611" ,""                  ,"37,38"],
		["개발1팀"       ,"매니저" ,"박혜연","원서접수,TRS"     ,"2102-5564","010-8858-7126" ,""                  ,"41"],
		["개발1팀"       ,"매니저" ,"김준"  ,"원서접수,TRS"     ,"2102-5589","010-2650-5858" ,""                  ,"42"],
		["개발1팀"       ,"매니저" ,"신재철","원서접수,대학관리자" ,"2102-5636","010-9391-6179" ,""                  ,"44"],
		["개발1팀"       ,"매니저" ,"박인태","uwayapply.com"    ,"2102-2493","010-9918-4195" ,""                  ,"52"],
		["개발1팀"       ,"매니저" ,"송진호","UPA"              ,"2102-2405","010-4946-8521" ,""                  ,"53"],
		["개발1팀"       ,"매니저" ,"차준엽","OZ,고교관리"      ,"2102-5660","010-6474-3734" ,"cjy2727@uway.com"  ,"47"],
		["개발1팀"       ,"매니저" ,"이애지",""                 ,"2102-5502","010-3811-7603" ,""                  ,"45"],
		["개발1팀"       ,"매니저" ,"조우진",""                 ,"2102-5579","010-2940-7026" ,""                  ,"54"],
		["개발1팀"       ,"매니저" ,"장성희",""                 ,"2102-5605","010-5141-4448" ,""                  ,"49"],
		["개발1팀"       ,"매니저" ,"김상욱",""                 ,"2102-5506","010-2923-4861" ,""                  ,"55"],
		["개발1팀"       ,"매니저" ,"홍보미",""                 ,"2102-5576","010-8374-2010" ,""                  ,"56"],
		["개발1팀"       ,"매니저" ,"이희창",""                 ,"2102-5679","010-7600-0211" ,"ihuichang@uway.com","48"],
		["개발1팀"       ,"매니저" ,"추재연",""                 ,"2102-5553","010-5577-5592" ,""                  ,"50"],
		["개발2팀"       ,"팀장"   ,"박용우",""                 ,"2102-5692","010-9179-4462" ,""                  ,"70"],
		["개발2팀"       ,"매니저" ,"김영진",""                 ,"2102-5691","*"             ,""                  ,"27"],
		["개발2팀"       ,"매니저" ,"오민지",""                 ,"2102-5574","*"             ,""                  ,"24"],
		["개발2팀"       ,"매니저" ,"박이현",""                 ,"2102-5614","*"             ,""                  ,"28"],
		["개발2팀"       ,"매니저" ,"강유림",""                 ,"2102-2468","*"             ,""                  ,"20"],
		["개발2팀"       ,"매니저" ,"임채문",""                 ,"2102-5677","010-8518-5933" ,""                  ,"73"],
		["개발2팀"       ,"매니저" ,"김재균",""                 ,"2102-5616","010-6480-7917" ,"jkkim@uway.com"    ,"75"],
		["개발2팀"       ,"매니저" ,"김지연",""                 ,"2102-5551","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"전은진",""                 ,"2102-2483","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"김용욱",""                 ,"2102-5680","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"이진아",""                 ,"2102-5591","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"이태경",""                 ,"2102-2401","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"이세영",""                 ,"2102-5591","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"김덕환",""                 ,"2102-2464","*"             ,""                  ,""],
		["개발2팀"       ,"매니저" ,"윤경섭",""                 ,"2102-5677","010-9828-9866" ,"ks.yoon@uway.com"  ,""],
		["개발3팀"       ,"팀장"   ,"김승환",""                 ,"2102-2471","010-9902-5118" ,"shkim@uway.com"    ,"72"],
		["개발3팀"       ,"매니저" ,"김도윤",""                 ,"2102-2408","010-9067-7810" ,"dykim@uway.com"    ,"76"],
		["개발3팀"       ,"매니저" ,"원철희",""                 ,"2102-5638","010-9974-4390" ,"hcwon@uway.com"    ,"74"],
		["개발지원팀"    ,"팀장"   ,"변장섭",""                 ,"2102-5653","010-6423-0184" ,""                  ,"22"],
		["개발지원팀"    ,"매니저" ,"강신혜",""                 ,"2102-5648","010-4266-2496" ,""                  ,"21"],
		["개발지원팀"    ,"매니저" ,"안희진",""                 ,"2102-5650","010-3018-3001" ,"hjahn@uway.com"    ,"12"],
		["시스템운영팀"  ,"팀장"   ,"김승일","IT Infra 관리"    ,"2102-5578","010-3754-9405" ,"sikim@uway.com"    ,"33"],
		["시스템운영팀"  ,"매니저" ,"서원택","IT Infra 관리"    ,"2102-5521","*"             ,"gardener@uway.com" ,"34"],
		["경영지원팀"    ,"팀장"   ,"박인권",""                 ,"2102-5588","010-5422-4114" ,"pik71@uway.com"    ,"245"],
		["엔지니어"      ,""       ,""      ,""                 ,"2102-5648","*"             ,""                  ,"35"],
		["Contents사업팀","매니저" ,"권용신",""                 ,"2102-5556","010-5280-5687" ,"yskwon@uway.com"   ,""]
	];
	
	ADDR["subsidiary"] = [
		["팀"  ,"직급","이름"  ,"업무"     ,"회사전화" ,"휴대전화"     ,"eMail"                ,"기타"],
		["그릿","부장","이혜연",""         ,"2102-5577","010-3793-3679",""                     ,""],
		["GRIT",""    ,"이중현",""         ,"2102-2431","010-5429-5012","lammy@uway.com"       ,""],
		["GRIT",""    ,"장진석",""         ,""         ,"010-4526-2934","jsjang@uway.com"      ,""],
		["GRIT",""    ,"이사"  ,"개발 총괄","2102-2429","010-4847-1553","mobilehunter@uway.com","86.68"]
	];

	ADDR["partner"] = [
		["회사 이름"       ,"직급"    ,"이름"  ,"업무"                 ,"회사전화"    ,"휴대전화"     ,"eMail"            ,"기타"],
		["WeRoad"          ,"부장"    ,"신동준","영업,IBM"             ,"02-6457-2001","010-3204-4962","djshin@weroad.kr",""],
		["WeRoad"          ,"차장"    ,"송철관","기술,IBM"             ,"02-6457-2002","010-8970-6708","cksong@weroad.kr",""],
		["WeRoad"          ,"차장"    ,"김준영","기술,IBM"             ,"02-6457-2001","010-6290-4908","jykim@weroad.kr",""],
		["오픈베이스"      ,"대리"    ,"남재하","F5BIG-IP"             ,"02-3404-5700","010-4354-8111","jaeha.nam@openbase.co.kr",""],
		["오픈베이스"      ,"대리"    ,"김명환","F5BIG-IP"             ,"02-3404-5700","010-3690-0941","kimmh@openbase.co.kr",""],
		["글로벌텔레콤"    ,"차장"    ,"홍성천","Paloalto"             ,""            ,"010-2654-4511","schong@u-quest.net",""],
		["ICTNet"          ,"차장"    ,"이택교","Network"              ,"02-539-0177" ,"010-8007-9720","free7605@ictnet.co.kr",""],
		["ICTNet"          ,"차장"    ,"정운영","Network"              ,""            ,"010-6822-3835","young@ictnet.co.kr",""],
		["JTSystem"        ,"사원"    ,"강정식","Anti-Ddos"            ,""            ,"010-2363-7479","jskang@jtsystems.co.kr",""],
		["넥스트테크놀러지","대리"    ,"최승우","IDS"                  ,""            ,"010-8222-9791","elwin007@unext.co.kr",""],
		["브링인포"        ,"대리"    ,"김창현","EMSNAS"               ,""            ,""             ,"",""],
		["브링인포"        ,"대리"    ,"표광일","Networker"            ,""            ,""             ,"",""],
		["LONSTECH"        ,"사원"    ,"황인호","(SLB)PIOLIN"          ,"02-3461-7704","010-9563-7411","ihhwang@lonstech.co.kr",""],
		["유니포인트"      ,"대리"    ,"장영진","(VPN)AhnLabTrustGuard","02-6676-5500","010-2018-0387","kingdom@unipoint.co.kr",""],
		["한싹"            ,"대리"    ,"김민성","(망연계)SecureGate"   ,"02-2082-1200","010-9962-9766","maiimskim@hanssack.co.kr",""],
		["가치데이타"      ,"연구소장","김남희","Oracle DB"            ,"02-3474-1555","010-9417-0009","sanedl@gmail.com<br>namhee.kim@gachidata.com",""],
		["한국정보평가원"  ,"대표"    ,"한흥렬","ISMS"                 ,""            ,"010-5668-2501","reichs@hanmail.net",""],
		["한국정보평가원"  ,"수석"    ,"김지연","ISMS"                 ,""            ,"010-9938-4164","jykimpro@gmail.com",""],
		["전문심사원"      ,"위원"    ,"김윤호","ISMS"                 ,""            ,""             ,"cyber794@naver.com",""],
		["글로벌텔레콤"    ,"과장"    ,"하승훈","Network"              ,""            ,"010-3760-8424","shha@globaltelecom.co.kr",""],
		["글로벌텔레콤"    ,"대리"    ,"김태경","Network"              ,""            ,"010-4729-4997","kyoung4997@globaltelecom.co.kr",""]
	];
	
	ADDR["resigned"] = [
		["팀"        ,"직급","이름"  ,"업무"            ,"회사전화" ,"휴대전화"     ,"eMail"           ,"기타(전직장명)"],
		["개발2팀"   ,"사원","김선혜","입학홈페이지"    ,"2102-5677","*"            ,""                ,"유웨이어플라이"],
		["개발지원팀","과장","김기영",""                ,"2102-5650","010-5273-9321","kky0604@uway.com","유웨이어플라이"],
		["개발3팀"   ,"대리","오태경",""                ,"2102-5570","*"            ,""                ,"유웨이어플라이"],
		["그릿"      ,"대리","장효진",""                ,"2102-2431","*"            ,""                ,"가족회사"]
	];

	ADDR["oldcolleague"]	= [
		["회사명"        ,"직급"  ,"이름"  ,"업무"            ,"회사/집전화" ,"휴대전화"     ,"eMail"           ,"최근 근황 및 이슈"]
	];
	ADDR["friends"]			= [
		["회사명"        , "직급"  ,"이름"  ,"업무"            ,"회사/집전화" ,"휴대전화"     ,"eMail"           ,"최근 근황 및 이슈"]
	];
	ADDR["family"]			= [
		["서열"        ,"내부서열"  ,"이름"  ,"거주지"            ,"회사/집전화" ,"휴대전화"     ,"eMail"           ,"최근 근황 및 이슈"],
		["둘째"   ,"작은삼촌"  ,"서수도","우이동"  ,"02-985-6300" ,"011-9889-2057" ,""                   ,""],
		["둘째"   ,"작은어머니","박XX"  ,"우이동"  ,"02-985-6300" ,"010-3605-2957" ,""                   ,""],
		["둘째"   ,"아들"      ,"서종배","건대"    ,""            ,"010-8998-4864" ,""                   ,"서의렴(2008)"],
		["셋째"   ,"작은삼촌"  ,"서창수","부산"    ,"051-622-9901","010-3565-9901" ,""                   ,"청력 좋지 않음"],
		["셋째"   ,"작은어머니","XXX"   ,"부산"    ,""            ,"010-2939-9901" ,""                   ,"몸이 좋지 않음"],
		["셋째"   ,"아들"      ,"서성택","건대"    ,""            ,"010-3841-5422" ,""                   ,"수협중앙회"],
		["셋째"   ,"아들2"     ,"서경택","부산"    ,""            ,"010-8998-4864" ,""                   ,"딸 서윤채(20??)"],
		["셋째"   ,"아들2처"   ,"XXX"   ,"부산"    ,""            ,"010-2406-5287" ,""                   ,""],
		["넷째"   ,"작은삼촌"  ,"서정수","용인"    ,"02-598-6793" ,"010-5236-6793" ,"seosu3@yahoo.co.kr" ,"삼성전자"],
		["넷째"   ,"작은어머니","박병렬","용인"    ,"-"           ,"010-6286-8400" ,""                   ,"딸1:별 아들:서준, 딸2:이슬 아들"]
	];
	ADDR["dev1role"]		= [];
	ADDR["search"]			= [];
	
	Mem.GRP		= GRP;
	Mem.ADDR	= ADDR;
	
}());
